[
  {
    "title": "Abitur (German High School Diploma)",
    "institution": "Gesamtschule Niederzier/Merzenich",
    "start": "2019",
    "end": "2021",
    "description": "After relocating from Lower Saxony/Hamburg, I continued my education at this school. I completed my Abitur with English and Social Sciences as advanced courses, German as an oral exam, and Mathematics as a written exam.",
    "grade": "1.9",
    "de": {
      "title": "Abitur",
      "description": "Nach dem Umzug aus Niedersachsen/Hamburg setzte ich meine Schullaufbahn an dieser Schule fort. Mein Abitur absolvierte ich mit Englisch und Sozialwissenschaften als Leistungskursen, Deutsch als mündlicher Prüfung und Mathematik als schriftlicher Prüfung."
    }
  },
  {
    "title": "Law Studies",
    "institution": "Heinrich Heine University Düsseldorf",
    "start": "2021",
    "end": "2022",
    "description": "I began studying law directly after graduating. After a year, I decided to pursue a more contemporary and creative career path. During this time, I gained valuable insights into legal thinking and working methods, including practical experience through an internship at a law firm.",
    "grade": "",
    "de": {
      "title": "Jurastudium",
      "description": "Ich begann mein Jurastudium direkt nach dem Abitur. Nach einem Jahr entschied ich mich bewusst für einen zeitgemäßeren und kreativeren Berufsweg. Dennoch gewann ich wertvolle Einblicke in juristisches Denken und Arbeitsweisen, unter anderem durch ein Praktikum in einer Anwaltskanzlei."
    }
  },
  {
    "title": "Dual Vocational Training as IT Specialist for Application Development, Operational Part",
    "institution": "cycos AG",
    "start": "2022",
    "end": "Summer 2025",
    "description": [
      "Started at a company in Düren, then transferred to another one in Aachen",
"Development and maintenance of modern, accessible web interfaces",
      "Working with internal component libraries and design systems",
      "Database-driven web development",
      "First-level support assistance",
      "Representing the company at career fairs and shareholder events"
    ],
    "grade": "88/100 points in the Chamber of Industry and Commerce (IHK) exam",
    "de": {
      "title": "Duale Berufsausbildung zur Fachinformatikerin für Anwendungsentwicklung, Betrieblicher Teil",
      "description": [
        "Gestartet in einem Unternehmen in Düren, dann Wechsel in ein anderes Unternehmen in Aachen",
        "Entwicklung und Wartung moderner, barrierefreier Web-Oberflächen",
        "Arbeit mit internen Komponentenbibliotheken und Designsystemen",
        "Datenbankgestützte Webentwicklung",
        "Unterstützung im First-Level-Support",
        "Repräsentation des Unternehmens auf Berufsmessen und Aktionärsveranstaltungen"
      ],
      "grade": "88/100 Punkte in der IHK-Prüfung"
    }
  },
  {
    "title": "Dual Vocational Training as IT Specialist for Application Development, Academic Part",
    "institution": "Berufskolleg für Technik Düren",
    "start": "2022",
    "end": "Summer 2025",
    "description": [
 "Foundations of computer science and software development",
      "Software development methods and processes",
      "Databases and network technologies",
      "Collaborative team project work"
    ],
    "grade": "1.5",
    "de": {
      "title": "Duale Berufsausbildung zur Fachinformatikerin für Anwendungsentwicklung, Schulischer Teil",
      "description": [
"Vermittlung von Informatikgrundlagen und Softwareentwicklung",
        "Softwareentwicklungsmethoden und -prozesse",
        "Datenbanken und Netzwerktechnologien",
        "Team- und Projektarbeit"
      ]
    }
  },
  {
    "title": "Junior Software Developer",
    "institution": "cycos AG",
    "start": "Summer 2025",
    "end": "",
    "description": [
"Continuing and expanding my responsibilities from vocational training",
      "Implementing design adjustments and UI improvements",
      "Supporting and mentoring new trainees"
    ],
    "grade": "",
    "de": {
      "title": "Junior Software-Entwicklerin",
      "description": [
        "Fortführung und Erweiterung meiner Tätigkeiten aus der Ausbildung",
        "Umsetzung von Design-Anpassungen und UI-Verbesserungen",
        "Unterstützung und Betreuung neuer Auszubildender"
      ]
    }
  }
]